** LSP Mode




#+begin_src elisp :tangle init.el

  (use-package lsp-mode
  :ensure t)
  (add-hook 'python-mode-hook #'lsp)

#+end_src

#+RESULTS:
| lsp | (lambda nil (lsp-python-enable)) | company-mode |


